{"pages":[{"text":"Λήψεις Κάντε λήψη : Αφού ολοκληρωθεί η λήψη του αρχείου bussinespi-15.04-1.img.zip κάντε εξαγωγή του περιεχωμένου. Έπειτα για την εγκατάσταση του σε BananaPi διαβάστε τις οδηγίες εδώ : https://github.com/ellak-monades-aristeias/BusinessPi/wiki/System-Setup Σημείωση: Αφού κάνετε εξαγωγή το αρχείο επιβεβαιώστε την ακεραιότητα του με sha256sum και sha1sum και επιβεβαιώστε ότι συμπίπτουν με τους παρακάτω αριθμούς user@ubuntu:~ $ sha256sum bussinespi-1504-1.img b838202bd25d7ead4f567450ae6e9787e5d5b9c678a18273b7b0d3239dc84371 bussinespi-1504-1.img και user@ubuntu:~ $ sha1sum bussinespi-1504-1.img c45a6e868c8db2d7dccc0ddba95573ff76195155 bussinespi-1504-1.img","tags":"pages","loc":"http://businesspi.github.io/pages/downloads.html","title":"Downloads"},{"text":"Τεκμηρίωση Η ανάπτυξη του έργου συνοδεύεται και απο εκτενή τεκμηρίωση με άρθρα, οδηγούς χρήσης και τεχνικές προδιαγραφές τα οποία μπορείτε να διαβάσετε στο Wiki του BusinessPi στην διεύθηνση : Αναφορά προβλήματος Για αναφορά προβλήματος σχετικό με οποιοδήποτε τμήμα του έργου BusinessPi (Λειτουργικό σύστημα, Λογισμικά, Ιστοσελίδα, Wiki) παρακαλώ επισκεφθείτε την σελίδα: κάντε κλίκ στο New Issue και συμπληρώστε το αίτημά σας όπως φαίνεται στην εικόνα παρακάτω απαντώντας κάποιες βασικές ερωτήσεις και δίνοντας αναλυτικές πληροφορίες για να μπορεί να αναπαραχθεί το πρόβλημα που αντιμετωπίζετε ώστε να γίνει προσπάθεια επίλυσής του. Επικοινωνία - Συζήτηση Για συζήτηση, η για να θέσετε ένα ερώτημα παρακαλώ επισκεφθείτε το Forum:","tags":"pages","loc":"http://businesspi.github.io/pages/feedback.html","title":"Feedback"},{"text":"Στα πλαίσια των ενεργειών δημοσιότητας για το BusinessPi έγινε παρουσίαση του στα πλαίσα των σεμιναρίων της Μονάδας Καινοτομίας και Επιχειρηματικότητας του πανεπιστημίου Μακεδονίας, στη σειρά σεμιναρίων \"Σεμινάρια Καινοτομίας και Επιχειρηματικότητας 30/09/15 - 23/10/15\". Προγραμμα Εκδήλωσης Η παρουσίαση έγινε στην αίθουσα \"Συνεδρίων\" του Παν. Μακεδονίας, την Τετάρτη 07 Οκτωβρίου και ώρα 18:50 - 19:20 στην εισήγηση με τίτλο \"Μετάβαση από την επιχειρηματική ιδέα στον επιχειρηματικό σχεδιασμό\" , με εισηγητή τον κ. Στέφανο Κουζώφ. Το κοινό αποτελούνταν από νέους επιχειρηματίες, ενδιαφερόμενους να ιδρύσουν τη δική τους επιχείρηση και φοιτητές και απόφοιτους του Πανεπιστημίου Μακεδονίας. Την εισήγηση παρακολούθησαν περισσότερα από 70 άτομα.","tags":"Photos","loc":"http://businesspi.github.io/seminario-businesspi-pamak.html","title":"Παρουσίαση BusinessPi στο Παν. Μακεδονίας"},{"text":"Εισαγωγή Η τροποποίηση (customisation) μιας υπάρχουσας διανομής (distribution) για κάποιο board είναι μια διαδικασία που μπορείτε να κάνετε σε περίπτωση που θέλετε να προσθέσετε-αφαιρέσετε κάποια πακέτα του συστήματος, να αλλάξετε λειτουργίες, να προσθέσετε-αφαιρέσετε κάποια αρχεία και γενικά αν θέλετε να δημιουργήσετε μια δικιά σας εκδοχή της διανομής πριν την εγκαταστήσετε στο board σας. Περιπτώσεις που μπορεί να είναι χρήσιμο αυτό είναι σε σχολεία, ιδρύματα, επιχειρήσεις κλπ όπου ο υπεύθυνος των πληροφοριακών συστημάτων θέλει να δημιουργήσει μια τροποποιημένη και εμπλουτισμένη εκδοχή μιας διανομής που θα χρησιμοποιηθεί σε κάποιο Singel Board Computer. Η μεθοδολογία που θα παρουσιαστεί είναι ο τρόπος με τον οποίο φτιάχτηκε η διανομή του έργου BusinessPi και μπορεί να φανεί χρήσιμη για όποιον θέλει να κάνει το ίδιο ανεξαρτήτως του board που διαθέτει. Εργαλεία και Μεθοδολογία Σε γενικά πλαίσια θα χρειαστεί να προετοιμάσουμε τον υπολογιστή στον οποίο θα δουλέψουμε για να προσομοιώσει ένα περιβάλλον εντολών για ARM αρχιτεκτονική. Ο υπολογιστής θα πρέπει να έχει λειτουργικό σύστημα Linux. Έπειτα θα χρειαστούμε μια βάση ως σημείο εκκίνησης, το οποίο είναι μια διανομή ειδικά φτιαγμένη για το board που διαθέτουμε. Τέλος προσαρτούμε την διανομή που κατεβάσαμε και κάνουμε εγκατάσταση η αφαίρεση των στοιχείων που θέλουμε. Προετοιμασία του υπολογιστή Θα χρειαστεί να εγκαταστήσουμε κάποια πακέτα για να μπορέσουμε να εκτελέσουμε εντολές που θα μεταφράζονται σε ARM περιβάλλον qemu qemu-user-static binfmt-support unzip Ανάλογα με την διανομή του υπολογιστή σας το όνομα των πακέτων μπορεί να διαφέρει. Εδώ θα δούμε πως γίνεται η εργασία σε Debian/Ubuntu συστήματα sudo apt-get install qemu qemu-user-static binfmt-support unzip Το qemu είναι ένας εξομοιωτής ARM ενώ τα qemu-user-static και binfmt-support μας επιτρέπουν να τρέξουμε εκτελέσιμα αρχεία ARM χωρίς να χρειάζεται να προσομοιώσουμε και πυρήνα ARM. Το unzip θα το χρειαστούμε για να αποσυμπιέσουμε το στιγμιότυπο που θα κατεβάσουμε. Λήψη βάσης Ανάλογα με το μοντέλο του Board μας θα πρέπει να επισκεφτούμε την αντίστοιχη ιστοσελίδα της κοινότητας η του κατασκευαστή και να κατεβάσουμε μια έτοιμη για το board μας διανομή. Διαλέξτε μια διανομή που σας ενδιαφέρει και προτιμήστε αυτήν για την οποία γνωρίζετε το σύστημα πακέτων που χρησιμοποιεί για να μπορέσετε εύκολα και γρήγορα να διαμορφώσετε το τελικό προϊόν. Επίσης πριν διαλέξετε μια διανομή, συμβουλευτείτε τον οδηγό, για να προσέξετε κάποια σημεία τα οποία θα πρέπει η διανομή της επιλογής σας να πληροί κάποιες προϋποθέσεις : Δημιουργία εταιρικού διακομιστή σε Singel Board Computer Ως παράδειγμα θα χρησιμοποιήσουμε το Bananian το οποίο χρησιμοποιήθηκε για την δημιουργία της διανομής του BusinessPi. Παρόλα αυτά η μεθοδολογία παραμένει ίδια για όποια διανομή και αν είναι συμβατή με το board σας. mkdir -p images/bananian-os wget \"http://dl.bananian.org/releases/bananian-15.04.zip\" -O \"images/bananian-os.zip\" unzip \"images/bananian-os.zip\" -d images/bananian-os rm images/bananian-os.zip Έτσι λοιπόν θα έχουμε ένα αρχείο .img στον φάκελο bananian-os το οποίο και θα τροποποιήσουμε για να φτιάξουμε την δική μας εκδοχή της διανομής. ls images/bananian-os bananian-1504.img Εύρεση κατατμήσεων Το αρχείο .img στον φάκελο bananian-os στην πραγματικότητα είναι ένας δίσκος ο οποίος έχει προεγκατασταθεί το λειτουργικό σύστημα και έχει χωριστεί σε κατατμήσεις. Σκεφτείτε το ως ένα στιγμιότυπο μιας χρονικής στιγμής του λειτουργικού συστήματος σε έναν σκληρό δίσκο. Θα πρέπει λοιπόν να δούμε που γίνεται η μετατόπιση (offset) των κατατμήσεων ήτοι που ξεκινάνε και που τελειώνουν. Αυτό γίνεται με τις παρακάτω εντολές: cd images/bananian-os sudo fdisk -lu bananian-1504.img η τελευταία θα μας δώσει ένα αποτέλεσμα όπως το παρακάτω Disk bananian-1504.img: 1.8 GiB, 1899999744 bytes, 3710937 sectors Units: sectors of 1 * 512 = 512 bytes Sector size ( logical/physical ) : 512 bytes / 512 bytes I/O size ( minimum/optimal ) : 512 bytes / 512 bytes Disklabel type : dos Disk identifier: 0x9f732a23 Device Boot Start End Sectors Size Id Type bananian-1504.img1 2048 43007 40960 20M 83 Linux bananian-1504.img2 43008 3710936 3667929 1.8G 83 Linux από το παραπάνω αποτέλεσμα χρειαζόμαστε τα εξής: Sector size (logical/physical): 512 bytes / 512 bytes Η ριζική κατάτμηση (/) ξεκινάει στους: 43008 τομείς Η κατάτμηση εκκίνησης (/boot) ξεκινάει στους: 2048 τομείς Κάθε τομέας είναι 512 bytes, έτσι ώστε η μετατόπιση της ριζικής κατάτμησης να είναι είναι 43008 * 512 = 22020096 bytes ενώ η μετατόπιση της κατάτμησης εκκίνησης είναι 2048 * 512 = 1048576 bytes Κρατάμε λοιπόν τους δύο αριθμούς: Partition / offset: 22020096 Partition /boot offset: 1048576 Προσάρτηση ως σύστημα αρχείων Στη συνέχεια, θα πρέπει να προσαρτήσουμε το στιγμιότυπο .img ως ένα σύστημα αρχείων. Αυτό μπορεί να γίνει χρησιμοποιώντας μια συσκευή loopback. Εδώ θα χρησιμοποιούμε και την τιμή του offset από την προηγούμενη ενότητα για να πούμε στην εντολή mount που θα προσαρτήσει το στιγμιότυπο και από που θα ξεκινάνε οι κατατμήσεις. Η σειρά αυτών των εντολών είναι σημαντική. sudo mount -o loop,offset = 22020096 \"bananian-1504.img\" /mnt sudo mount -o loop,offset = 1048576 \"bananian-1504.img\" /mnt/boot Προετοιμασία του συστήματος αρχείων Τώρα θα πρέπει να αντιγράψουμε τον εξομοιωτή στο προσαρτημένο σύστημα αρχείων sudo cp /usr/bin/qemu-arm-static /mnt/usr/bin/ Επίσης θα χρειαστεί να παρέχουμε στο προσαρτημένο σύστημα αρχείων κάποια στοιχεία του λειτουργικού συστήματος του υπολογιστή μας sudo mount --rbind /dev /mnt/dev sudo mount -t proc none /mnt/proc sudo mount -o bind /sys /mnt/sys Είσοδος στο απομονωμένο περιβάλλον Το σύστημα μας είναι έτοιμο και μπορούμε να εισέλθουμε σε αυτό κάνοντας χρήση του περιβάλλοντος chroot sudo chroot /mnt Με την είσοδό σας σε αυτό το απομονωμένο περιβάλλον θα παρατηρήσετε ότι άλλαξε το τερματικό σας και πλέον είστε root και μπορείτε να εκτελέσετε εντολές που θα εκτελούσατε σε μια διανομή που είναι εγκατεστημένη σε υπολογιστή. root@debian / # root@debian / # ls bin/ etc/ lost+found/ opt/ run/ srv/ tmp/ boot/ home/ media/ proc/ sbin/ swapfile1 usr/ dev/ lib/ mnt/ root/ selinux/ sys/ var/ Τώρα μπορείτε να κάνετε εγκατάσταση η αφαίρεση πακέτων και ότι άλλο χρειάζεστε να έχει η τελική σας διανομή. Συμβουλευτείτε τον οδηγό Δημιουργία εταιρικού διακομιστή σε Singel Board Computer για να δείτε πως μπορείτε π.χ. να εγκαταστήσετε το εταιρικό λογισμικό VtigerCRM. Ολοκλήρωση Αφού έχετε τελειώσει με την διαμόρφωση της διανομής μπορείτε να κάνετε έξοδο από το περιβάλλον με δυο τρόπους: exit CTRL+D Τώρα διαγράψτε το αρχείο qemu-user-static που είχαμε αντιγράψει πριν. sudo rm /mnt/usr/bin/qemu-arm-static Τέλος οπό-πορσαρτήστε το σύστημα αρχείων των δυο κατατμήσεων sudo umount /mnt sudo umount /mnt/boot Η διανομή σας πλέον είναι έτοιμη και μπορείτε να την εγκαταστήσετε όπως διαβάσατε στον οδηγό εγκατάστασης σε προηγούμενο άρθρο . Αντιμετώπιση σφαλμάτων Σε περίπτωση που στην προσπάθεια από-προσάρτησης λάβετε ένα μήνυμα όπως παρακάτω umount: /mnt: target is busy ( In some cases useful info about processes that use the device is found by lsof ( 8 ) or fuser ( 1 ) . ) Τότε σημαίνει ότι κάποια υπηρεσία που εκτελείται στο προσαρτημένο σύστημα αρχείων αποτρέπει την από-προσάρτηση. Σε αυτή την περίπτωση μπορείτε να εντοπίσετε την υπηρεσία που εκτελείται και να την τερματίσετε με Λύση 1 sudo lsof /mnt COMMAND PID USER FD TYPE DEVICE SIZE/OFF NODE NAME bash 16715 user cwd DIR 8,81 16384 6931 /mnt cat 33753 root 1w REG 8,81 0 6944 /mnt kill -9 16715 33753 lsof /mnt sudo umount /mnt Λύση 2 showmount -e Export list for alpha: /mnt/ 192.168.1.200 /etc/init.d/nfs-kernel-server stop umount /mnt/ Λύση 3 losetup -a /dev/loop0: [ 0851 ] :6983 ( /mnt/disk.img ) /dev/loop1: [ 0851 ] :6986 ( /mnt/boot/disk2.img ) umount /mnt/disk.img umount /mnt/boot/disk2.img umount: /mnt/boot/disk2.img: not mounted losetup -d /dev/loop1 umount /mnt/boot Λύση 4 cat /proc/swaps Filename Type Size Used Priority /mnt/swapfile file 95480 0 -2 # swapoff /mnt/swapfile # umount /mnt/ Λύση 5 dmesg [ . ] lost page write due to I/O error on md0 [ . ] Buffer I/O error on device md0, logical block 16804 [ . ] INFO: task cp:27736 blocked for more than 120 seconds. [ . ] \"echo 0 > /proc/sys/kernel/hung_task_timeout_secs\" disables this message. [ . ] cp D ffff88053fdd39c0 0 27736 27734 0x00000004 umount -l /mnt Λύση 6 Δημιουργείστε ένα bash script με περιεχόμενα τον παρακάτω κώδικα και εκτελέστε το. #!/usr/bin/env bash ls -l /proc/*/root | grep -v \"\\-[>] / $\" for procpid in /proc/*/root; do linktarget= $( readlink ${ procpid } ) if [ \" ${ linktarget } \" != \" / \" ]; then echo \" ${ procpid } chrooted to ${ linktarget } \" fi done","tags":"Documentation","loc":"http://businesspi.github.io/dimiourgia-dianomis-board.html","title":"Τροποποίηση διανομής και δημιουργία νέας για Single Board Computer"},{"text":"Παρουσίαση του έργου BusinessPi Παρακάτω παραθέτω το βίντεο από την ομιλία - παρουσίαση που έκανα για το έργο BusinessPi στην εκδήλωση εορτασμού του Software Freedom Day που διοργάνωσε ο GreekLUG Θεσσαλονίκης. Επίσης παραθέτω και το αρχείο παρουσίασης για όσους θέλουν να το δουν, μιας και στο βίντεο δεν φαίνεται καθαρά. Επί τη ευκαιρία θα ήθελα να ευχαριστήσω όλους όσους μπόρεσαν να παραβρεθούν, παρά την βροχή, στην παρουσίαση του έργου αλλά και όσους βοήθησαν στην αρχική μετάφραση του Vtiger ( διαβάστε τα ονόματα στο αρχείο του Vtiger ) αλλά και τον Πασχαλίδη Κωσταντίνο για την δημιουργία του logo του BusinessPi και τον Πουλκίδη Χαράλαμπο για τις παρατηρήσεις και τις διορθώσεις που πρότεινε για την ιστοσελίδα του BusinessPi . Βίντεο Αρχείο παρουσίασης Το αρχείο παρουσίασης μπορείτε να το δείτε κάνοντας δεξί κλικ \"άνοιγμα σε νέα καρτέλα\" εδώ","tags":"Videos","loc":"http://businesspi.github.io/video-parousiasi-businesspi-greeklug.html","title":"Βίντεο από την παρουσίαση του BusinessPi"},{"text":"Εκδήλωση εορτασμού SFD 2015 Ο GreekLUG στις 26 Σεπτεμβρίου διοργανώνει εκδήλωση για τον εορτασμό του Software Freedom Day (SFD) 2015. Η εκδήλωση προώθηση του Ελεύθερου Λογισμικού, των διανομών GNU/Linux και το Ανοικτό Περιεχόμενο. Το απόγευμα της ίδιας μέρας προσκλήθηκα να παρουσιάσω το έργο BusinessPi στις 18:00, στην έδρα του GreekLUG Εγνατίας 96, Πυλαία - Θεσσαλονίκη ( κλίκ για να δείτε στον χάρτη ). Για τους σκοπούς της παρουσίασης θα υπάρξει βιντεοσκόπηση η οποία μαζί με τα αρχεία παρουσίασης θα είναι διαθέσιμα από την ιστοσελίδα του BusinessPi. Ενημέρωση 28-9-2015: το βίντεο και το αρχείο παρουσίασης είναι διαθέσιμα εδώ Ακολουθεί η ανακοίνωση: Ανακοίνωση Ο GreekLUG σας προσκαλεί το Σάββατο 26 Σεπτεμβρίου 2015, στον εορτασμό του Software Freedom Day (SFD) 2015! To πρόγραμμα της ημέρας περιλαμβάνει διάφορες δράσεις που περιέχουν στην προώθηση του Ελεύθερου Λογισμικού, των διανομών GNU/Linux και το Ανοικτό Περιεχόμενο. Κατά την διάρκεια της ημέρας και τις ώρες, 10:00-15:00, θα βρισκόμαστε στον πεζόδρομο Αγίας Σοφίας στο κέντρο της Θεσσαλονίκης για την ενημέρωση του κοινού για το ΕΛ/ΛΑΚ! Το απόγευμα, μετά τις 18:00, η ημέρα συνεχίζεται στην έδρα του Συλλόγου μας με παρουσιάσεις, install fest, καφέ και χαλαρή συζήτηση! Οι παρουσιάσεις θα διαρκέσουν για δύο περίπου ώρες και θα αφορούν: μία γενική παρουσίαση για το ΕΛ/ΛΑΚ, την SFD 2015 και τα πλεονεκτήματα χρήσης Ελεύθερου Λογισμικού, και μία ειδική παρουσίαση για το νέο πρότυπο έργο \"BusinessPi\" [http://businesspi.github.io/], το οποίο αφορά ένα \"Μινιμαλιστικό LAMP stack με VTiger CRM για το ανοικτό hardware Pi-board\", από τον Σαλήχ Εμίν H Σελίδα του GreekLUG στο Facebook: GreekLUG Facebook Page","tags":"News","loc":"http://businesspi.github.io/businesspi-software-freedom-day-greeklug.html","title":"Παρουσίαση του έργου BusinessPi στην εκδήλωση SFD του GreekLUG"},{"text":"Στο προηγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi και είδαμε τεχνικές λεπτομέρειες σχετικά με το Hardware του. Μπορείτε να τα διαβάσετε στις παρακάτω αναρτήσεις: Τι είναι το BusinessPi Hardware δοκιμών Λειτουργικό Σύστημα, Υπηρεσίες παρασκηνίου και Λογισμικό Διαθέσιμη η έκδοση 15.04-1 του BussinessPi για λήψη Σύνδεση BananaPi και εγκατάσταση του BusinessPi Δημιουργία εταιρικού διακομιστή σε Pi board Η ενότητα αυτή περιλαμβάνει όλα όσα χρειάζεται να γνωρίζει ο αναγνώστης σχετικά με την \"κλωνοποίηση\" του έργου BusinessPi. Απευθύνεται με λίγα λόγια σε όσους επιθυμούν να αγοράσουν τον ίδιο ή παρεμφερή εξοπλισμό, να εγκαταστήσουν συμβατή διανομή και να εγκαταστήσουν το λογισμικό που περιλαμβάνεται στο BusinessPi με στόχο την δημιουργία χαμηλού κόστους εταιρικού διακομιστή για την νεοφυή εταιρεία τους. Εισαγωγή Παρότι η αρχιτεκτονική των Single-board computer υπολογιστικών συστημάτων είναι αρκετά παλιά, εντούτοις άρχισε να γίνεται εκτεταμένη η χρήση τους τα τελευταία 5 χρόνια σε εκπαιδευτικούς οργανισμούς, ερευνητικά κέντρα αλλά και επιχειρήσεις. Ο λόγος ήταν η ευρεία αποδοχή του RaspberyPi (\"ο υπολογιστής των 25$\") από την κοινότητα ΕΛ/ΛΑΚ αλλά και η παράλληλες εξελίξεις της αρχιτεκτονικής των ARM επεξεργαστών στα smartphone. Στα τελευταία, η τεχνολογική ανάπτυξη στον τομέα των SoC οδήγησε στην παράλληλη αύξηση των επιδόσεων και την μείωση του κόστους του τελικού προϊόντος. Έτσι σήμερα έχουμε μια ευρεία γκάμα από χαμηλού κόστους, σε σχέση με τους παραδοσιακούς υπολογιστές PC, και αρκετά υψηλών επιδόσεων Single-board computers τα οποία μπορεί ο αναγνώστης να μελετήσει, να συγκρίνει και να επιλέξει αυτό που θα καλύψει τις ανάγκες της δικής του επιχείρισης. Είναι σίγουρο ότι στο προσεχές διάστημα οι εξελίξεις αλλά και νέες εκδόσεις των Single-board computers θα παρέχουν μεγαλύτερες επιδόσεις σε χαμηλό κόστος και θα γίνει ακόμα πιο διαδεδομένη η χρήση τους σε επιχειρηματικό περιβάλλον μιας και ιδιαίτερα για τις νεοφυής επιχειρήσεις το διαθέσιμο κεφάλαιο εκκίνησης είναι χαμηλό. Υλικό Το υλικό που απαιτείται για να δημιουργήσετε έναν μικρό εταιρικό διακομιστή βασισμένο σε Single-board computer (ή Pi Board για συντομία) αποτελείται από: Board Παρελκόμενα Board Στην παγκόσμια αγορά κυκλοφορούν Pi Boards που διαφέρουν κυρίως στις επιδόσεις του επεξεργαστή και της μνήμης. Παρότι σήμερα ήδη έχουμε Pi Boards με τετραπύρηνους επεξεργαστές και 1 GB μνήμης RAM, απο τις εξελίξεις στον τομέα των SoC διαφαίνεται ότι θα υπάρχουν περισσότερες εναλλακτικές διαθέσιμες. Ένας εκτενείς συγκριτικός πίνακας βρίσκεται στην σελίδα : https://en.wikipedia.org/wiki/Comparison_of_single-board_computers Για τους σκοπούς του έργου BusinessPi, αφού αποκλείσαμε κάποια μοντέλα (λόγοι κόστους/διαθεσιμότητας/επιδόσεων) επιλέξαμε και συγκρίναμε τα board που εμφανίζονται στον παρακάτω πίνακα. Προτείνουμε στον αναγνώστη να επιλέξει αυτό που θα καλύψει τις δικές του ανάγκες (Σημείωση η τιμή κόστους είναι ενδεικτική) Παρελκόμενα Συνήθως η αγορά του Board δεν περιλαμβάνει κάποιες βασικές επεκτάσεις τις οποίες θα πρέπει να τις αοράσουμε ξεχωριστά: Απαραίτητα είναι : - Καλώδιο δικτύου - Κάρτα SD - Τροφοδοσία ρεύματος Προαιρετικά ανάλογα με τα χαρακτηριστικά του μοντέλου: - Καλώδιο HDMI/VGA για σύνδεση σε οθόνη - Καλώδιο SATA για σύνδεση με δίσκο SATA - Καλώδιο εξόδου για ηχεία - USB Hub για σύνδεση πληκτρολογίου/ποντικιού Για όλα τα παραπάνω είναι απαραίτητη η προσεκτική ανάγνωση των προδιαγραφών που θέτει ο κατασκευαστής (ιδιαίτερα για την παροχή ρεύματος) ώστε το borad μας να λειτουργεί αξιόπιστα και αδιάλειπτα. Λειτουργικό Σύστημα Το λειτουργικό σύστημα που υποστηρίζουν τα διαθέσιμα board της αγοράς, είναι στην πλειοψηφία τους βασισμένα στο Linux. Συγκεκριμένα, αποτελούν εξειδικευμένη και τροποποιημένη έκδοση κάποιας από τις γνωστότερες διανομές Linux που προορίζονται για τους κοινούς υπολογιστές. Λόγο της αρχιτεκτονικής των board (ARM επεξεργαστές) δεν μπορούμε να εγκαταστήσουμε διανομή Desktop χωρίς προσαρμογές και μεταγλώττιση του πηγαίου κώδικα για την αρχιτεκτονική του board μας. Παρόλα αυτά οι κατασκευαστές των board αλλά και οι κοινότητα ΕΛ/ΛΛΑΚ έχουν μεταφέρει αρκετές διανομές και μπορούμε να τις εγκαταστήσουμε από την σελίδα του κατασκευαστή ή από την αντίστοιχη κοινότητα του board. Οι δύο πιο διαδεδομένες διανομές που θα βρούμε εκδόσεις τους διαθέσιμες για όλα σχεδόν τα board είναι αυτές που βασίζονται στο Ubuntu και το Debian. Αν παρόλα αυτά ο αναγνώστης επιθυμεί να εγκαταστήσει κάποια άλλη διανομή Linux στον εταιρικό του διακομιστή βασισμένο σε Pi board, θα θέλαμε να επιστήσουμε την προσοχή του στο να διαλέξει κάποια που έχει και εταιρική παρουσία ετών στον χώρο των διακομιστών. Έτσι οι διανομές βασισμένες σε Debian, Ubuntu, CentOS είναι αξιόπιστες για χρήση σε εταιρικό περιβάλλον, μιας και διαθέτουν εταιρική παρουσία σε τομείς όπως Servers, Workstations, Cloud Infrastracture και Workstations. Με αυτό τον τρόπο αποκλείονται προβλήματα συμβατότητας με εταιρικά λογισμικά, κρίσιμα προβλήματα λογισμικού και κενά ασφαλείας, μιας και οι διανομές αυτές λόγο και της εταιρικής παρουσίας τους εκδίδουν σύντομα και συχνά διορθώσεις λογισμικού και κενών ασφαλείας. Ενδεικτικά, για τους σκοπούς του έργου, το BusinessPi είναι βασισμένο σε μια ειδική διανομή (Bananian) βασισμένη στο Debian. (βλέπε Λειτουργικό σύστημα ) Για την εγκατάσταση του λειτουργικού συστήματος θα χρειαστεί να κάνετε λήψη συνήθως μιας προρυθμισμένης εικόνας δίσκου (Image disk) που είναι προσαρμοσμένη για το board σας. Έπειτα μπορείτε να το κάντε εγκατάσταση στο board σας όπως περιγράφεται στον οδηγό Εγκατάσταση Λειτουργικού . Υπηρεσίες Η επόμενη κρίσιμη απόφαση που πρέπει να λάβει ο αναγνώστης είναι τον ρόλο που θα αναθέσει στον εταιρικό διακομιστή. Ο διακομιστής θα παρέχει στο εταιρικό δίκτυο, ειδικού σκοπού υπηρεσίες, που περιλαμβάνουν συνήθως μια ή παραπάνω από τις παρακάτω εργασίες: Διαχείριση Εταιρικών mail Διαμοιρασμός Αρχείων με κοινόχρηστους φακέλους Εκτέλεση εταιρικών λογισμικών (ήτοι CRM) Ιδιαίτερη προσοχή πρέπει να δοθεί στην περίπτωσή των Pi board το γεγονός ότι ανάλογα με τον αριθμό χρηστών που θα χρησιμοποιούν τις υπηρεσίες του διακομιστή αυξάνονται και οι απαιτήσεις σε επιδόσεις. Οπότε θα πρέπει αν γίνει προσεκτική μελέτη και προγραμματισμός για το ποιες υπηρεσίες θα παρέχονται μέσω του Pi Board και πως (χρήση εξωτερικού δίσκου SATA, χρήση NAS κλπ.). Ενδεικτικά, για τους σκοπούς του έργου, το BusinessPi παρέχει υπηρεσίες Web Server (Apache) με βάση δεδομένων (MySQL) και SSH server για να μπορέσετε να συνδέεστε από τον υπολογιστή σας απομακρυσμένα. (βλέπε Λειτουργικό σύστημα ) Πριν προχωρήστε παρακαλούμε μελετήστε τον οδηγό (βλέπε Εγκατάσταση ) μιας και πολλά σημεία του για λόγους αποφυγής επανάληψης δεν θα αναφερθούν εδώ. Λογισμικό Ανάλογα με την υπηρεσία που θα διεκπεραιώνει ο διακομιστής θα πρέπει να εγκατασταθούν οι απαραίτητες βιβλιοθήκες του συστήματος αλλά και τα λογισμικά για την υποστήριξη, καταγραφή και παρακολούθηση του λειτουργικού συστήματος. Ενδεικτικά, για τους σκοπούς του έργου, το BusinessPi είναι ρυθμισμένο να παρέχει το εταιρικό λογισμικό Vtiger CRM. (βλέπε Λειτουργικό σύστημα ) Η εγκατάσταση του λογισμικού αυτού μπορεί να γίνει με δυο τρόπους: Αυτοματοποιημένα Χειροκίνητα Αυτόματη εγκατάσταση Για την εγκατάσταση των λογισμικών που παρέχονται όπως και στο BusinessPi αναπτύχθηκε ένα λογισμικό αυτόματης εγκατάστασης. Το λογισμικό αυτό είναι συμβατό με διανομές που βασίζονται στο Debian ή το Ubuntu . Για την χρήση του θα χρειαστεί να έχετε εγκατεστημένα δυο λογισμικά στο σύστημά σας: Wget (π.χ. sudo apt-get install wget) Unzip (π.χ. sudo apt-get install unzip) Επομένως συνδεθείτε στο board σας : ssh user@ip-οf-board Όπου user είναι το προεπιλεγμένο όνομα του χρήστη της διανομής που επιλέξατε και κάνατε εγκατάσταση και το ip-οf-board είναι η IP του board σας όπως διαβάσατε στον οδηγό Εύρεση IP Έπειτα θα πρέπει να κάντε λήψη του λογισμικού αυτόματης εγκατάστασης: wget https://github.com/BusinessPi/vtiger-installer/archive/master.zip Εξάγετε το περιεχόμενο του αρχείου zip: unzip master.zip Εισέλθετε στον φάκελο vtiger-installer-master cd vtiger-installer-master Εκτελέστε τον αυτόματο εγκαταστάτη sudo ./businesspi-vtiger-installer.sh Μόλις ξεκινήσει θα δείτε την παρακάνω εικόνα Μετά απο 5 δευτερόλεπτα θα ξεκινήσει ενημέρωση του συστήματος, ρύθμιση παραμέτρων διευθυνσιοδότησης και εγκατάστασης υπηρεσιών Web Server και MySQL Κατά την εγκατάσταση της MySQL θα χρειαστεί να θέσετε ένα ασφαλές συνθηματικό για τον χρήστη root της MySQL (Προσοχή δεν είναι ο χρήστης root του συστήματος) Έπειτα θα σας ζητηθεί να βάλετε το συνθηματικό root που θέσατε για την MySQL ώστε να εκτελεστεί ο οδηγός ασφάλειας MySQL. Στην ερώτηση αλλαγής συνθηματικού root απαντήστε αρνητικά ενώ στα υπόλοιπα καταφατικά Στη συνέχεια θα γίνει αυτόματα η λήψη, αποσυμπίεση και ρύθμιση παραμέτρων εγκατάστασης του Vtiger CRM. Μόλις ολοκληρωθούν τα βήματα του λογισμικού αυτόματης εγκατάστασης θα δείτε το μήνυμα : Τώρα θα πρέπει να ρυθμίσετε τον υπολογιστή σας στο host αρχείο του να μεταφράζει το http://vtiger.businesspi.local στην IP που έχει λάβει (ή θέσατε εσείς) για να να συνδεθείτε στο Vtiger Επομένως τώρα μπορείτε με βάση τις οδηγίες Ρυθμιση Στατικής IP και Domain να συνδεθείτε στο Vtiger CRM του board σας. Αφού συνδεθείτε από τον browser του υπολογιστή σας στο http://vtiger.businesspi.local ακολουθήστε τις οδηγίες Ρύθμισης του vtiger που είδαμε στο προϊγούμενο άρθρο. Χειροκίνητη εγκατάσταση Αφού συνδεθείτε στο board σας ενημερώστε το σύστημά σας: sudo apt-get update && sudo apt-get -y upgrade Αλλάξτε το Hostname του συστήματος σε vtiger sudo cp /etc/hostname /etc/hostname.origin sudo echo 'vtiger' > /etc/hostname και το domain σε vtiger.businesspi.local ώστε το board σας να διαθέτει FQDN sudo nano /etc/hosts 127.0.0.1 localhost.localdomain localhost 127.0.1.1 vtiger.businesspi.local vtiger ::1 localhost ip6-localhost ip6-loopback fe00::0 ip6-localnet ff00::0 ip6-mcastprefix ff02::1 ip6-allnodes ff02::2 ip6-allrouters Ενεργοποιείστε τις νέες ρυθμίσεις invoke-rc.d hostname.sh start Ελέγξτε οτι είναι σωστές με την παρακάτω εντολή να επιστέφει vtiger.businesspi.local hostname -f Εγκαταστήστε τις υπηρεσίες Apache, MySQL και τις απαραίτητες για το Vtiger βιβλιοθήκες: sudo apt-get -y install apache2 libapache2-mod-php5 mysql-server php5-mysql php5-imap php5-xmlrpc php5-gd php5-curl apache2-utils libgd-tools Εκτελέστε τον οδηγό ασφάλειας MySQL και απαντήστε στις ερωτήσεις sudo mysql_secure_installation Κάντε λήψη το Vtiger CRM 6.3.0 wget http://sourceforge.net/projects/vtigercrm/files/vtiger%20CRM%206.3.0/Core%20Product/vtigercrm6.3.0.tar.gz Καντε εξαγωγή του αρχείου, μεταφορά στον φάκελο του webserver και ρυθμίστε τα δικαιώματα χρήσης και εκτέλεσής του από τον Web Server tar -xvzf vtigercrm6.3.0.tar.gz rm /var/www/index.html mv vtigercrm /var/www/vtigercrm chmod -R 775 /var/www/vtigercrm chown -R www-data:www-data /var/www/vtigercrm Ρυθμίστε την PHP με βάση τις προδιαγραφές που απαιτούνται απο το Vtiger CRM βλέπε Vtiger PHP Configuration sudo cp /etc/php5/apache2/php.ini /etc/php5/apache2/php.ini.origin sudo nano /etc/php5/apache2/php.ini Δημιουργήστε και ρυθμίστε το vhost αρχείο vtigercrmapache για Vtiger sudo nano /etc/apache2/sites-available/vtigercrmapache <VirtualHost *:80> ServerName vtiger.businesspi.local DocumentRoot /var/www/vtigercrm <Directory /var/www/vtigercrm> Options FollowSymLinks AllowOverride None </Directory> # Possible vaues include: debug, info, notice, warn, error, crit, # alert, emerg. LogLevel warn ErrorLog /var/log/apache2/vtigercrm-error.log CustomLog /var/log/apache2/vtigercrm-access.log combined ServerSignature Off </VirtualHost> Αφού αποθηκεύσετε και κλείσετε το αρχείο, ενεργοποιείστε το νέο vhost και απενεργοποιήστε τον προεπιλεγμένο του apache sudo a2ensite vtigercrmapache sudo a2dissite 000-default Κάντε επανεκκίνηση των υπηρεσιών Apache και MySQL sudo service apache2 restart sudo service mysql restart Επομένως τώρα μπορείτε με βάση τις οδηγίες Ρυθμιση Στατικής IP και Domain να συνδεθείτε στο Vtiger CRM του board σας. Αφού συνδεθείτε από τον browser του υπολογιστή σας στο http://vtiger.businesspi.local ακολουθήστε τις οδηγίες Ρύθμισης του vtiger που είδαμε στο προϊγούμενο άρθρο. Επίλογος Η αγορά του Pi Board και του περιφερικού εξοπλισμού, για εταιρικές ανάγκες, δεν πρέπει να ξεπερνά τα 100 ευρώ. Ο δε χρόνος εγκατάστασης του λειτουργικού, η ρύθμιση των υπηρεσιών και των λογισμικών, με τις οδηγίες που περιλαμβάνονται σε αυτό το wiki και ανάλογα με την τεχνογνωσία του αντικειμένου αλλά και την προσωπική του εμπειρία του αναγνώστη δεν θα χρειαστεί να είναι παραπάνω από περίπου 1-2 ώρες.","tags":"Documentation","loc":"http://businesspi.github.io/dimiourgia-server-pi-board.html","title":"Δημιουργία εταιρικού διακομιστή σε Single Board Computer (Pi board)"},{"text":"HUMANWINE [Public domain] via Wikimedia Commons Στο προηγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi και είδαμε τεχνικές λεπτομέρειες σχετικά με το Hardware του. Μπορείτε να τα διαβάσετε στις παρακάτω αναρτήσεις: Τι είναι το BusinessPi Hardware δοκιμών Λειτουργικό Σύστημα, Υπηρεσίες παρασκηνίου και Λογισμικό Διαθέσιμη η έκδοση 15.04-1 του BussinessPi για λήψη Εγκατάσταση Λειτουργικού Για να κάνετε εγκατάσταση του λειτουργικού συστήματος θα χρειαστείτε : Λήψη Λειτουργικού συστήματος (Βλέπε Downloads ) SD Card class 10 (ελάχιστος απαιτούμενος χώρος 2GB) * SD Card Reader στον υπολογιστή σας Αφού κάνετε λήψη του λειτουργικού συστήματος, κάντε εξαγωγή το αρχείο και επιβεβαιώστε την ακεραιότητα του (βλέπε Οδηγίες λήψης ). Έπειτα συνδέστε την SD κάρτα στον υπολογιστή σας και ανάλογα με το λειτουργικό σύστημα του υπολογιστή σας εκτελέστε μια από τις παρακάτω διαδικασίες: Linux Εντοπίστε το όνομα της SD κάρτας στον υπολογιστή σας με την εντολή lsblk ή την dmesg (π.χ. μπορεί να το δείτε προσαρτημένο με το όνομα /dev/mmcblk0 ) και κάντε αποπροσάρτηση με την εντολή umount π.χ. sudo umount /dev/<όμομα συσκευής> Κάντε εγγραφή του image του λειτουργικού στην SD κάρτα με το λογισμικό dd : sudo dd if = bananian-1504.img of = /dev/<όνομα συσκευής> bs = 1M && sync Windows Οι χρήστες Windows μπορούν να χρησιμοποιήσουν το Win32 Disk Imager. Για λήψη του λογισμικού επισκεφθείτε την ιστοσελίδα : http://sourceforge.net/projects/win32diskimager/ MacOS X Εντοπίστε το όνομα της SD κάρτας στον υπολογιστή σας με την εντολή 'diskutil list' και κάντε αποπροσάρτηση με την εντολή 'diskutil unmountDisk' όλη την συσκευή π.χ (έστω η συσκευή είναι disk9). diskutil unmountDisk disk9 Κάντε εγγραφή του image του λειτουργικού στην SD κάρτα με το λογισμικό dd : sudo dd if = bananian-1504.img of = /dev/disk9 bs = 1M && diskutil eject disk9 Πηγή Οδηγού Σύνδεση και πρώτη εκκίνηση Αφού έχετε ολοκληρώσει την εγγραφή του λειτουργικού συστήματος στην SD κάρτα, τώρα: Συνδέστε την Κάρτα SD στο Pi board Συνδέστε το καλώδιο δικτύου στο Pi board και την άλλη άκρη σε μια θύρα του router σας Συνδέστε την παροχή ρεύματος στο Pi Board σας (MicroUSB 28/24 AWG καλώδιο 2Αmp/5V DC) Το σύστημα θα εκκινήσει άμεσα και θα δείτε τα χαρακτηριστικά led να αναβοσβήνουν. Εύρεση IP του Pi board Το Pi Board είναι ρυθμισμένο να λαμβάνει αυτόματα μια IP που θα έχει αναθέσει ο DHCP Server του router σας. Ενδεικτικά για να εντοπίσετε την IP του board σας μπορείτε να συνδεθείτε στο router σας μέσω του browser του υπολογιστή σας (διαβάστε το manual του μοντέλου του router σας) γράφοντας στην διεύθυνση του browser σας την IP του router σας (θα έχει την μορφή 192.168.1.0). Αφού συνδεθείτε, βρείτε την DHCP list που θα περιλαμβάνει όλα τα IP που έχουν ανατεθεί απο το router. Εναλλακτικά μπορείτε σε περιβάλλον Linux να χρησιμοποιήσετε το λογισμικό Arp-Scan : sudo arp-scan -l -v το αποτέλεσμα της εντολής θα επιστρέψει κάτι που μοιάζει με το παρακάτω Interface: wlan0, datalink type : EN10MB ( Ethernet ) Using 10.3.2.0:255.255.255.0 for localnet Starting arp-scan 1.8.1 with 256 hosts ( http://www.nta-monitor.com/tools/arp-scan/ ) 10.3.2.8 ec:1a:59:87:60:b8 ( Unknown ) 10.3.2.40 10:60:4b:4e:09:73 ( Unknown ) --- Pass 1 complete 10.3.2.88 02:4f:0b:42:97:35 ( Unknown ) --- Pass 2 complete Σύνδεση με SSH στο Pi Board Για την σύνδεση με το Pi Board θα χρειαστείτε τερματικό περιβάλλον ικανό να εκτελεί SSH συνδέσεις. (Επισκεφθείτε την επίσημη ιστοσελίδα η την κοινότητα που αντιστοιχεί στο λειτουργικό του υπολογιστή σας για περισσότερες πληροφορίες) Μια από τις IP που αναφέρονται είτε στην λίστα DHCP του router σας είτε στη επιστροφή της εντολής arp-scan είναι του η IP του Pi board σας οπότε μπορείτε να δοκιμάσετε να συνδεθείτε με SSH σε μια απο αυτές. Το όνομα χρήστη είναι root και το password είναι businesspi (το οποίο θα πρέπει να το αλλάξετε για λόγους ασφαλείας) Αν απορριφθεί η σύνδεση συνεχίζετε με την επόμενη IP. Παράδειγμα: salih@debian:~ $ ssh root@10.3.2.40 ssh: connect to host 10.3.2.40 port 22: Connection refused salih@debian:~ $ ssh root@10.3.2.88 The authenticity of host '10.3.2.88 (10.3.2.88)' can 't be established. RSA key fingerprint is SHA256:epMOnf1ENl7M6FaSd1Qkvsu9bvx6k2v20mSnYX8E. Are you sure you want to continue connecting (yes/no)? yes (εδώ πληκτρολογείτε yes και πατάτε enter) Warning: Permanently added ' 10.3.2.88 ' (RSA) to the list of known hosts. root@10.3.2.88' s password: Linux bananapi 3.4.104-bananian #1 SMP PREEMPT Mon Apr 6 18:25:40 UTC 2015 armv7l ------------------------------------------------------------------------ Welcome to Bananian Linux! For news and updates check: https://www.bananian.org Any questions? Read the FAQ first: https://www.bananian.org/faq Run 'bananian-config' to set up Bananian Linux Run 'bananian-update' to check for distribution updates ------------------------------------------------------------------------ root@vtiger ~ # Εφόσον δείτε την επιστροφή root@bananapi ~ # είστε πλέον συνδεδεμένοι στο λειτουργικό σύστημα του Pi board σας, όπου μπορείτε να εκτελείτε όλες τις διαθέσιμες εργασίες που παρέχει ένα Debian GNU/Linux λειτουργικό σύστημα. Ρυθμίσεις SSH Eίναι συμαντικό να αλλάξετε το port στο οποίο συνδέεστε μέσω ssh, να δημιουργήσετε εκ νέου κλειδιά κρυπτογραφημένης σύνδεσης και να εγκαταστίσετε κάποιον διαχειριστή firewall: Για την ρύθμιση του SSH port: root@vtiger ~ # nano /etc/ssh/sshd_config και αλάξτε στην γραμμή Port 22 την 22 σε διαφορετική. Έπειτα κάντε επανεκκίνηση την υπηρεσία SSH: root@vtiger ~ # invoke-rc.d ssh restart Έτσι την επόμενη φορά που θα συνδεθείτε χρησιμοποιήστε το νέο port με την παράμετρο -p <νέα τιμή> Για την δημιουργία κλειδιών επαναρυθμίστε: root@vtiger ~ # rm -v /etc/ssh/ssh_host_* root@vtiger ~ # dpkg-reconfigure openssh-server Creating SSH2 RSA key ; this may take some time ... [ ok ] Restarting OpenBSD Secure Shell server: sshd. Αφού δημιουργηθούν νέα κλειδιά, αποσυσνδεθείτε απο το board και αφαιρέστε απο τον υπολογιστή σας τα παλιά κλειδιά διότι σε διαφορετική περίπτωση όταν θα προσπαθήσετε να συνδεθείτε θα δείτε το παρακάτω μήνυμα με το οποίο αποτυγχάνεται η πιστοποίηση κλειδιών κρυπτογράφησης.: @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ @ WARNING: REMOTE HOST IDENTIFICATION HAS CHANGED! @ @@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ IT IS POSSIBLE THAT SOMEONE IS DOING SOMETHING NASTY! Someone could be eavesdropping on you right now ( man-in-the-middle attack ) ! It is also possible that a host key has just been changed. The fingerprint for the RSA key sent by the remote host is SHA256:jhagsdsjdasd47163817897098029ysdsd/g. Please contact your system administrator. Add correct host key in /home/salih/.ssh/known_hosts to get rid of this message. Offending RSA key in /home/salih/.ssh/known_hosts:9 remove with: ssh-keygen -f \"/home/salih/.ssh/known_hosts\" -R [ 10.3.2.88 ] RSA host key for [ 10.3.2.88 ] has changed and you have requested strict checking. Host key verification failed. Η αφαίρεση μπορεί να γίνει με δυο τρόπους: ssh-keygen -R <ip-to-board> ή εναλλακτικά δείτε στο μήνυμα την γραμμή Οffending RSA key in /home/salih/.ssh/known_hosts:9 ανοίξτε το αρχείο known_hosts και αφαιρέστε την αντίστοιχη εγγραφή με τον παρακάτω τρόπο: vi +9 .ssh/known_hosts Πατήστε dd για να διαγράψετε την γραμμή. Αποθηκεύστε και κλείστε με :wq Τέλος σας συνιστούμε να εγκαταστισετε και να ρυθμίστε κάποιον διαχειριστή των iptables (π.χ. shorewall, ufw κλπ) που σας βολεύει και να το ρυθμίσετε να δέχετε την νέα τιμή του Port για SSH που βάλατε παραπάνω. Περισσότερα για σχετικά με τις ρυθμίσεις SSH και Firewall/iptables δείτε στους επίσημους οδηγούς του Debian: https://wiki.debian.org/SSH#Securing https://wiki.debian.org/DebianFirewall https://wiki.debian.org/iptables Πρώτη ρύθμιση Για την χρήση του λογισμικού Vtiger που έρχεται προεγκατεστιμένο στο BusinessPi θα πρέπει να ρυθμίσετε τον υπολογιστή σας να αναγνωρίζει το domain του BusinessPi αλλά και να θέσετε μια στατική IP στο BusinessPi Ρύθμιση του BusinessPi Οι ρυθμίσεις που θα πρέπει να κάνετε είναι οι εξής: Ρυθμίσεις λειτουργικού συστήματος Συνδεθείτε στο BusinessPi χρησιμοποιώντας την IP του BusinessPi. ssh root@<IP-Τοu-BusinessPi> Ο κωδικός του root είναι : businesspi (τον οποίο τον αλλάζετε αμέσως μετά). Έπειτα εκτελέστε της εντολή bananian-config και απαντήστε στις ερωτήσεις όπως παρακάτω: Αλλαγή root password : Υ (αλλάξτε τον κωδικό) Τime zone : Ν Character set : N Hostname : N Video acceleration : N (Απαντήστε θετικά ΜΟΝΟ αν σκοπεύετε να συνδέσετε οθόνη στο BananaPi σας ) USB OTG status : N Size of the root file system : Y - (Για να επεκταθεί το σύστημα αρχείων στο μέγεθος της κάρτας SD) Η ρύθμιση έχει ολοκληρωθεί. Ρύθμιση βάσης δεδομένων Για την πρώτη ρύθμιση της βάσης δεδομένων MySQL μπορείτε να εκτελέσετε τον οδηγό: mysql_secure_installation o κωδικός σύνδεσης για τον root της βάσης δεδομένων είναι businesspi . Απαντήστε με Υ σε όλες τις ερωτήσεις. Μια καλή πρακτική είναι να δημιουργίσετε εναν νέο χρήστη της MySQL με σκοπό να τον χρησιμοποιείσετε ως χρήστη της βάσης δεδομένων για τις ρυθμίσεις του Vtiger που θα δούμε παρακάτω. Σε περίπτωση που θέλετε να δημιουργήστε χρήστη/βάση απο πριν μπορείτε να χρησιμοποιείσετε έναν εύχρηστο διαχείριση της MySQL (π.χ. μπορείτε να εγκαταστίστε phpMyAdmin ή mysql-workbench ). Σχετικά με αυτά μπορείτε να διαβάσετε στους επίσημους οδηγούς τους: https://wiki.debian.org/MySql https://www.mysql.com/products/workbench/ https://www.phpmyadmin.net/ Ρύθμιση Στατικής IP για το BusinessPi Πριν όμως κάνουμε επανεκκίνηση το σύστημα θα πρέπει να ρυθμίσουμε μια στατική IP ώστε να μην χρειάζεται κάθε φορά να ψάχνουμε την IP του board μας επειδή ο DHCP λαμβάνει αυτόματα την IP απο το rooter μας. Θα χρειαστεί να επεξεργαστούμε το αρχείο /etc/network/interfaces root@vtiger ~ # nano /etc/network/interfaces # interfaces(5) file used by ifup(8) and ifdown(8) auto lo iface lo inet loopback auto eth0 # dhcp configuration # iface eth0 inet dhcp (<--- ΕΔΩ βάζουμε # στην αρχή) # static ip configuration ( Συμπληρώνουμε όπως παρακάτω) iface eth0 inet static address 192.168.10.200 netmask 255.255.255.0 network 192.168.10.0 broadcast 192.168.10.255 gateway 192.168.10.1 #οι dns-* επιλογές ρυθμίζονται απο το πακέτο resolvconf, εφόσον είναι εκγατεστημένα dns-nameservers 192.168.10.1 dns-search vtiger.businesspi.local Για τις τιμές που θα βάλετε στα αντίστοιχα πεδία θα πρέπει να δείτε ποιες είναι οι σωστές από τις ρυθμίσεις του router σας ή απο τον υπολογιστή σας (πληροφορίες δικτύου). Θα πρέπει να προσέξετε να μην βάλετε κάποια IP στην τιμή address που ήδη έχει ανατεθεί σε άλλη συσκευή στο δίκτυό σας για να μην προκληθεί διένεξη των διευθύνσεων. Αποθηκεύστε το αρχείο και κλείστε το. Μια τελευταία ρύθμιση είναι να προσθέσετε την στατική IP και στο /etc/hosts αρχείο. root@vtiger ~ # nano /etc/hosts 127.0.0.1 localhost 127.0.1.1 vtiger.businesspi.local vtiger 192.168.10.200 vtiger.businesspi.local vtiger # The following lines are desirable for IPv6 capable hosts ::1 localhost ip6-localhost ip6-loopback ff02::1 ip6-allnodes ff02::2 ip6-allrouters Αποθηκεύστε το αρχείο και κλείστε το. Έπειτα κάντε επανεκκίνηση του συστήματος : shutdown -r now Ρύθμιση αναγνώρισης του Domain του BusinessPi Ο υπολογιστής απο τον οποίο συνδέεστε στον BusinessPi σας θα πρέπει να ρυθμιστεί ώστε να αναγνωρίζει το domain του BusinessPi. Ανάλογα με το λειτουργικό σας σύστημα θα χρειαστεί να βρείτε και να ανοίξετε το αρχείο hosts και να βάλετε την IP που θέσατε για το Board σας και να γράψετε δίπλα το Domain vtiger.businesspi.local όπως κάνατε παραπάνω στο αρχείο /etc/hosts του board σας. Επαναλάβετε την ίδια διαδικασία σε όσους υπολογιστές στο εταιρικό σας δίκτυο διαθέτετε και επιθυμείτε να χρησιμοποιούν το Vtiger του BusinessPi. Πλέον μπορείτε να συνδέεστε και όπως παρακάτω (χωρίς χρήση IP): ssh root@vtiger.businesspi.local Ρύθμιση του Vtiger Σχετικά με το τι είναι το Vtiger, μιλήσαμε στο προηγούμενο άρθρο \" Λειτουργικό Σύστημα, Υπηρεσίες παρασκηνίου και Λογισμικό \". Η πρώτη ρύθμιση του Vtiger ξεκινάει με την πρώτη επίσκεψη στο domain http://vtiger.businesspi.local Αφού πατήσετε Install το Vtiger θα ελέγξει αν όλες οι προαπαιτούμενες ρυθμίσεις του συστήματος είναι έγκυρες. Εφόσον όλα είναι εντάξει πατήστε Next για να συμπληρώσετε τα στοιχεία του διαχειριστή Vtiger, τα στοιχεία εισόδου στην βάση δεδομένων MySQL και το νόμισμα. Εάν δεν έχετε δημιουργήσει βάση δεδομένων από πριν, τότε κάντε κλικ στο κουτάκι \"Create New Database\" και εισάγετε τα στοιχεία εισόδου διαχειριστή της βάσης (root). Εφόσον όλα τα στοιχεία που δώσατε είναι ορθά, η εγκατάσταση θα ξεκινήσει μόλις πατήσετε Next . Η εγκατάσταση και ρύθμιση της βάσης μπορεί να πάρει αρκετά λεπτά. Μόλις ολοκληρωθεί η παραπάνω διαδικασία, θα ερωτηθείτε ποιες δυνατότητες του Vtiger θέλετε να είναι εξαρχής ενεργοποιημένες. Επιλέξτε αυτά που σας ενδιαφέρουν ή αρμόζουν στην ιδιότητα της επιχείρησης σας και πατήστε Next . Η ρύθμιση των επιπλέον διαθέσιμων δυνατοτήτων μπορεί να γίνει και μετά την εγκατάσταση, στις ρυθμίσεις του CRM. Μόλις ολοκληρωθεί η ενεργοποίηση των δυνατοτήτων, το Vtiger θα σας συνδέσει αυτόματα ως διαχειριστή όπου θα κάνετε την πρώτη ρύθμιση του λογαριασμού του διαχειριστή. Είστε έτοιμοι ! Τώρα μπορείτε κάνοντας κλικ στο \"Γρανάζι\" δεξιά επάνω, να επιλέξετε \"CRM Settings\" για να προσθέσετε νέες δυνατότητες, νέους χρήστες, ομάδες, ρυθμίσεις αναφορών κ.α. Τέλος να αναφέρουμε ότι έχουμε εξελληνισμένο το Vtiger 6 και μπορείτε να προσθέσετε το πακέτο ελληνικής γλώσσας μέσα απο το CRM σας . Επισκεφθείτε το επίσημο Vtiger Marketpalce για να δείτε λεπτομέρειες. Σας συστήνουμε ανεπιφύλακτα να μελετήσετε τον επίσημο οδηγό χρήσης του Vtiger https://wiki.vtiger.com/vtiger6/index.php/Main_Page . Να σημειώσουμε ότι στον οδηγό πολλές φορές μπορεί να αναφέρονται για το Online Vtiger ή ως On-demand Vtiger, το οποίο είναι η online έκδοση που προσφέρεται ως ενοικιαζόμενοι υπηρεσία από την εταιρία Vtiger.","tags":"Documentation","loc":"http://businesspi.github.io/sindesi-egkatastasi-businesspi.html","title":"Σύνδεση BananaPi και εγκατάσταση του BusinessPi"},{"text":"Είμαι στην ευχάριστη θέση να σας ανακοινώσω την διαθεσιμότητα της πρώτης έκδοσης του BusinessPi για το BananaPi Board. Μπορείτε να κάνετε λήψη από την σελίδα: Doawnloads Για όσους το ακούτε πρώτη φορά διαβάστε το άρθρο \" Τι είναι το BussinessPi \" Μετά από αρκετές εβδομάδες δοκιμών επί δοκιμών, όταν φτάνεις στο σημείο να ολοκληρώνεις το έργο και είναι έτοιμο να το διαθέσεις στο ευρύτερο κοινό, το συναίσθημα είναι απερίγραπτο. Ελπίζω να σας φανεί χρήσιμο. Όπως είπαμε, είμαι στην διάθεση όλων για επικοινωνία (Βλέπε Feedback )","tags":"News","loc":"http://businesspi.github.io/diathesimi-gia-lipsi-1504-1.html","title":"Διαθέσιμη η έκδοση 15.04-1 του BussinessPi για λήψη"},{"text":"Στο προϊγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi και είδαμε τεχνικές λεπτομέριες σχετικά με το Hardware του. Μπορείτε να τα διαβάσετε στις παρακάτω αναρτήσεις: Τι είναι το BusinessPi Hardware δοκιμών Λειτουργικό Σύστημα Για τις ανάγκες του λειτουργικού συστήματος του έργου BusinessPi, μετά την επιλογή που έγινε σχετικά με το Hardware (βλέπε Hardware ) επιλέχτηκε να χρησιμοποιηθεί ως βάση το Bananian . Το Bananian είναι ένα ΕΛ/ΛΑΚ λειτουργικό σύστημα το οποίο είναι μια ελαφρώς τροποποιημένη και βελτιστοποιημένη για το Banana Pi εκδοχή του Debian. Χρησιμοποιεί τα επίσημα αποθετήρια του Debian για αρχιτεκτονικές armhf και πυρήνα Linux μαζί με bootmanager u-boot μεταγλωττισμένο για το Banana Pi. Ως αποτέλεσμα των παραπάνω το λειτουργικό του BusinessPi εκμεταλλεύεται την βελτιστοποίηση που έχει υποστεί το Bananian για την συμβατότητά του με το Banana Pi Board με την αξιοπιστία, διαθεσιμότητα λογισμικού και υποστήριξης που έχει απο την κοινότητά του το Debian GNU/Linux Λογισμικό Το λειτουργικό σύστημα του έργου BusinessPi αποτελείται απο: Bananian Linux Υπηρεσίες Λογισμικό Bananian Linux Το Bananian Linux παρέχει προεγκατεστημένα τα εξής: Μινιμαλιστικό Debian 7 (Wheezy) armhf Επίσημα αποθετήρια του Debian Linux kernel: 3.4.x (sunxi-linux) Σύστημα init: SysVinit zsh (κέλυφος με ρυθμίσεις απο το http://grml.org/zsh/, το κέλυφος bash είναι επίσης διαθέσιμο) Υπηρεσίες Το λειτουργικό σύστημα είναι προρυθμισμένο να παρέχει στους χρήστες του δικτύου τις εξής υπηρεσίες SSH server apache server mysql server lm-sensors (θερμοκρασίες) NTP server haveged (entropy daemon) rsyslogd (syslog daemon) Λογισμικό Το λειτουργικό σύστημα παρέχει προεγκατεστημένα τα εξής λογισμικά VTiger CRM (Διαχείριση Πελατολογίου και Προϊόντων/Υπηρεσιών) htop (παρακολούθηση του συστήματος) bwm-ng (παρακολούθηση bandwith) screen (terminal multiplexer) bananian-config: ορισμός timezone, locales, hostname, root password, video acceleration, hardware platform, OTG port και επέκταση συστήματος αρχείων (για να ρυθμίσετε το σύστημα αρχείων να καταλαμβάνει όλη την κάρτα SD) bananian-update: αναβάθμιση του Bananian σε νέα έκδοση του λειτουργικού. Επειδή το έργο απαιτούσε (για λόγους δοκιμών) πολλαπλές και επαναλαμβανόμενες εγκαταστάσεις του Vtiger CRM και Apache/MySQL στο BananaPi, ως μέρος του έργου αναπτύχθηκε λογισμικό που αυτοματοποιεί την λήψη, ρύθμιση των υπηρεσιών και εγκατάσταση του Vtiger στο λειτουργικό σύστημα. Το λογισμικό αυτό, ο αναγνώστης μπορεί να το χρησιμοποιήσει σε οποιοδήποτε σύστημα βασισμένο σε Debian/Ubuntu ανεξάρτητα αν το λειτουργικό σύστημα είναι εγκατεστημένο σε Board, PC, Server ή Εικονική μηχανή. Θα παρουσιάσουμε το λογισμικό σε ένα απο τα επόμενα άρθρα. VtigerCRM Το Vtiger είναι ένα ελεύθερο και ανοιχτού κώδικα ( βλέπε Vtiger Open Source ) εταιρικό λογισμικό που εντάσσεται στην κατηγορία λογισμικών \"Διαχείρισης Πελατειακών Σχέσεων\" CRM και είναι ήδη προεγκατεστημένο στο BusinessPi. Η Διαχείριση Πελατειακών Σχέσεων (CRM) είναι μία ευρέως εφαρμοσμένη στρατηγική για την διαχείριση των αλληλεπιδράσεων μιας επιχείρησης με πελάτες, συμβολαιούχους πελάτες και προοπτικές πωλήσεων. Το Vtiger χρησιμοποιείται για να οργανώσει, αυτοματοποιήσει και να συγχρονίσει διεργασίες – κυρίως δραστηριότητες πωλήσεων, αλλά και αυτές που αφορούν το μάρκετινγκ, την εξυπηρέτηση πελατών και την τεχνική υποστήριξη μιας επιχείρησης. Οι γενικοί στόχοι του Vtiger είναι να βοηθήσει σε όλες τις εργασίες που έχουν να κάνουν με την εύρεση, προσέλκυση και απόκτηση νέων συμβολαιούχους πελάτες, να διατηρήσει αυτούς που η επιχείρηση ήδη έχει, να δελεάσει πρώην πελάτες να έρθουν πίσω, και να μειώσει το κόστος του μάρκετινγκ και της εξυπηρέτησης πελατών. Οι δυνατότητες που παρέχει απευθύνονται σε όλες τις επιχειρήσεις που κάνουν πώληση προϊόντων ή υπηρεσιών αλλά και εταιρίες συμβούλων, δικηγόρων, ιατρών, λογιστών, ασφαλιστών και άλλων. Συνοπτικά περιλαμβάνει: Ημερολόγιο Διαχείριση Email Πελατολόγιο / Ιστορικό συναλλαγών Διαχείριση Προωθητικών ενεργειών Τιμολόγηση Διαχείριση Έργων Αναφορές / Στατιστικά δεδομένα Σας συστήνουμε ανεπιφύλακτα να μελετήσετε τον επίσημο οδηγό χρήσης του Vtiger https://wiki.vtiger.com/vtiger6/index.php/Main_Page . Να σημειώσουμε ότι στον οδηγό πολλές φορές μπορεί να αναφέρονται για το Online Vtiger ή ως On-demand Vtiger, το οποίο είναι η online έκδοση που προσφέρεται ως ενοικιαζόμενη υπηρεσία από την εταιρία Vtiger. Τέλος να αναφέρουμε ότι έχουμε εξελληνισμένο το Vtiger 6 και μπορείτε να προσθέσετε το πακέτο ελληνικής γλώσσας μέσα απο το CRM σας . Επισκεφθείτε το επίσημο Vtiger Marketpalce για να δείτε λεπτομέρειες.","tags":"Documentation","loc":"http://businesspi.github.io/leitourgiko-upiresies-logismiko.html","title":"Λειτουργικό Σύστημα, Υπηρεσίες παρασκηνίου και Λογισμικό"},{"text":"Banana Pi M1 Στο προϊγούμενο άρθρο κάναμε μια εισαγωγή στο τι είναι το BusinessPi το οποίο μπορείτε να διαβάσετε στην ανάρτηση : Τι είναι το BusinessPi Σήμερα θα κάνουμε μια παρουσίαση του Hardware δοκιμών που χρησιμοποιήθηκαν για την υλοποίηση του BusinessPi. Για τις ανάγκες του έργου έγινε εκτεταμένη έρευνα αγοράς για να επιλέξουμε τον ιδανικό συνδυασμό hardware και software ώστε να πληρούν τις εξής προϋποθέσεις : Ικανοποιητικές επιδόσεις για συνθήκες μιας μικρής επιχείρησης (έως 3-5 χρήστες) Συνδεσιμότητα και επεκτασιμότητα του hardware Βέλτιστο λόγο αξίας προς τιμή Αφού αποκλείσαμε κάποια μοντέλα (λόγοι κόστους/διαθεσιμότητας/επιδόσεων) επιλέξαμε και συγκρίναμε τα board που εμφανίζονται στον παρακάτω πίνακα. (Σημείωση η τιμή κόστους είναι ενδεικτική) Έτσι καταλήξαμε ότι η πρώτη έκδοση του έργου BusinessPi να γίνει διαθέσιμη για το Banana Pi M1 . Παρόλα αυτά η εγκατάσταση των λογισμικών που διαθέτει το BusinessPi μπορεί να γίνει αυτόματα με χρήση του ειδικού λογισμικού που αναπτύξαμε, ανεξάρτητα από το Board ή το λειτουργικό Linux που διαθέτει το Board σας. Η παρουσίαση του λογισμικού θα γίνει τις επόμενες μέρες. Συνοπτική περιγραφή του Banana Pi M1 Το Banana Pi M1 είναι ένας single-board υπολογιστής που κατασκευάζεται στην Κίνα. Χρησιμοποιεί την Allwinner Α20 SoC, διαθέτει διπύρηνο επεξεργαστή, 1GB RAM και η σύνδεση με το δίκτυο γίνεται διαμέσου της ενσωματωμένης ethernet. Το βασικό και επίσημο λειτουργικό σύστημα του BananaPi είναι το Bananian το οποίο είναι μια βελτιστοποιημένη έκδοση του λειτουργικού συστήματος Debian GNU/Linux για την πλατφόρμα του Banana Pi. Παρόλα αυτά όμως ο χρήστης μπορεί αν εγκαταστήσει και άλλες διανομές Linux. Ως λειτουργικά συστήματα υποστηρίζει : Android Ubuntu Debian OpenSUSE Fedora Μια εκτενείς λίστα διαθέσιμων λειτουργικών συστημάτων συμβατών με το Banana Pi M1 μπορείτε να δείτε εδώ http://www.banana-pi.org/download.html Τεχνικές προδιαγραφές Οι τεχνικές προδιαγραφές του Banana Pi M1 έχουν ως εξής: Οι θέσεις των προδιαγραφών που αναφέρονται στον παραπάνω πίνακα μπορούν να εντοπιστούν στο BananaPi στην παρακάτω εικόνα : Παρελκόμενα Επειδή τα board στην αγορά έρχονται ως έχουν (χωρίς δηλαδή περιφερικά), για τις ανάγκες του έργου χρησιμοποιήσαμε επίσης: μια SD Card Class 10 (για τις ανάγκες του OS/Software Stack) καλώδιο MicroUSB (για παροχή ρεύματος) καλώδιο δικτύου (για σύνδεση στο υφιστάμενο δίκτυο/internet) τα οποία φαίνονται στην παρακάτω εικόνα όπως είναι συνδεδεμένα και μπορείτε να διαβάσετε στην ανάρτηση : επί το έργον","tags":"Documentation","loc":"http://businesspi.github.io/hardware-dokimon.html","title":"Hardware δοκιμών"},{"text":"Καλωσήρθατε στο έργο BusinessPi Open data / opensourceway / CC BY-SA Το έργο BusinessPi αποτελεί συνδυασμό ανοικτού λογισμικού (μινιμαλιστικoύ LAMP stack και πλήρους VTiger CRM) και ανοικτού hardware (Pi-board), που συνδεόμενο στο τοπικό δίκτυο αυτοματοποιεί μια νέα εμπορική/υπηρεσιών η και εξαγωγική επιχείρηση (τηλέφωνα, ραντεβού, πωλήσεις, αποθήκη, υποστήριξη πελατών, γνωσιακή βάση κ.α.), με κόστος λιγότερο από 100 ευρώ (αγορά hardware). Τις επόμενες μέρες θα αναρτηθούν όλα όσα έχουν συνταχθεί με σκοπό να καταγράψουμε και να μεταδώσουμε γνώσεις σχετικά με: Τεχνικές προδιαγραφές Μεθοδολογίες Λογισμικά Hardware Εμπειρικά δεδομένα Τα παραπάνω καταγράφηκαν, συγκεντρώθηκαν και συντάχθηκαν πριν αλλά και κατά την διάρκεια ανάπτυξης του έργου BusinessPi προς όφελος την κοινότητας ΕΛ/ΛΑΚ με απώτερο σκοπό την Τυποποίηση των εργασιών που απαιτούνται για να μπορεί οποιοσδήποτε να αναπαράγει το έργο . Τις επόμενες μέρες θα αναρτήσω οδηγούς, αναφορές, τεχνικές πληροφορίες για το υλικό (Hardware) αλλά και το λογισμικό (software) το οποίο χρησιμοποιήθηκε για την ανάπτυξη του έργου BusinessPi Με την ανάγνωση των ενοτήτων, σκοπός είναι ο αναγνώστης να έχει μια πλήρη εικόνα των εργασιών και να μπορεί, εάν το επιθυμεί : Να δημιουργήσει το δικό του μικρό εταιρικό διακομιστή σε Pi Board Να μεταδώσει της γνώσεις στην κοινότητα ΕΛ/ΛΑΚ Να προτείνει νέες λύσεις Να συνδράμει στην βελτίωση και ανάπτυξη του έργου με την συμμετοχή του στην κοινότητα BusinessPi Καλούμε όσους ενδιαφέρονται να εμπλουτίσουν, να προτείνουν ή γενικά να συνδράμουν σε οποιοδήποτε τμήμα του έργου να επικοινωνήσουν μέσω του Support Puzzle pieces / ©opensource.com via Flickr / CC BY-SA Σκοπός της κοινότητας Σκοπός της κοινότητας BusinessPi είναι η προώθηση και ανάπτυξη: Ανοιχτών Προτύπων Ελεύθερου Λογισμικού Τεχνολογιών Ανοιχτής Αρχιτεκτονικής Διάδοση τεχνογνωσίας πληροφοριακών συστημάτων στο χώρο των επιχειρήσεων στην Ελλάδα, ενώ παράλληλα φιλοδοξεί να αποτελέσει κέντρο γνώσης και πλατφόρμα διαλόγου για επαγγελματίες IT που εργάζονται αλλά και χρησιμοποιούν ανοιχτές τεχνολογίες στον χώρο εργασίας τους. Με το έργο BusinessPi, προσπαθήσαμε να δημιουργήσουμε μια αρχική γνωσιακή βάση δεδομένων στην προσπάθειά μας να δώσουμε μια λύση συνδυασμού Hardware και Software, που αυτοματοποιεί μια νέα μικρή εμπορική/υπηρεσιών η και εξαγωγική επιχείρηση (τηλέφωνα, ραντεβού, πωλήσεις, αποθήκη, υποστήριξη πελατών, γνωσιακή βάση κ.α.), με κόστος λιγότερο από 100 ευρώ (για αγορά του hardware). Παράλληλα στόχος είναι να γίνουν παρουσιάσεις (βλέπε για νέα στην ιστοσελίδα http://businesspi.github.io/ ) του έργου σε εκδηλώσεις της κοινότητας ΕΛ/ΛΑΚ στην Ελλάδα και ταυτόχρονα να προσεγγίσουμε ομάδες που ασχολούνται με την επιχειρηματικότητα, τα stαrtups και την πληροφορική γενικότερα. Συνοψίζοντας, με το έργο BusinessPi ευελπιστούμε στην προσέλκυση ενδιαφερόμενων που θα συμμετέχουν στην κοινότητα BusinessPi για να: Διαδώσουμε το ΕΛ/ΛΑΚ στην επιχειρηματική κοινότητα Δημιουργήσουμε μια ενιαία αγορά υπηρεσιών ΕΛ/ΛΑΚ για ΜΜΕ Διευκολύνουμε τοπικούς επαγγελματίες της πληροφορικής να διαδώσουν το ΕΛ/ΛΑΚ, αποκομίζοντας ταυτόχρονα τα προς το ζην. Εμπλουτίσουμε την γνωσιακή βάση με τεκμηρίωση προερχόμενη από τις γνώσεις και εμπειρίες που αποκτήθηκαν κατά την υλοποίηση έργων ΕΛ/ΛΑΚ σε εταιρικά περιβάλλοντα. Όσοι ενδιαφέρονται παρακαλούμε όπως διαβάσουν τις οδηγίες στην σελίδα Support","tags":"Documentation","loc":"http://businesspi.github.io/ti-einai-to-businesspi.html","title":"Τι είναι το BusinessPi"},{"text":"Μιας και ολοκληρώθηκε η βασική δομή της ιστοσελίδας του BusinessPi θεώρησα ότι θα ήταν λογικό ανεβάσω μια εικόνα του BananaPi στο οποίο αναπτύσσεται το έργο. Επίσης να αναφέρω ότι ήδη έχει ξεκινήσει η σύνταξη της τεκμηρίωσης του όλου εγχειρήματος στο Wiki page . Υπάρχουν όμως πολλά ακόμα που έχουν να γίνουν σχετικά με το έργο αλλά και την καταγραφή της όλης προσπάθειας και είναι ήδη προγραμματισμένα να ανέβουν στην ιστοσελίδα, το wiki αλλά και το αποθετήριο.","tags":"Photos","loc":"http://businesspi.github.io/epi-to-ergon.html","title":"Επί το έργον"},{"text":"Αυτή είναι η επίσημη σελίδα του έργου BusinessPi.","tags":"News","loc":"http://businesspi.github.io/hello-world.html","title":"Hello World"}]}