{"pages":[{"text":"Λήψεις Επισκεφθείτε την σελίδα με τα περιεχόμενα του έργου στο Github Σύντομα θα είναι διαθέσιμη η πρώτη έκδοση του λειτουργικού για λήψη και εγκατάσταση στο Pi Board σας","tags":"pages","loc":"http://businesspi.github.io/pages/downloads.html","title":"Downloads"},{"text":"Τεκμηρίωση Η ανάπτυξη του έργου συνοδεύεται και απο εκτενή τεκμηρίωση με άρθρα, οδηγούς χρήσης και τεχνικές προδιαγραφές τα οποία μπορείτε να διαβάσετε στο Wiki του BusinessPi στην διεύθηνση : https://github.com/ellak-monades-aristeias/BusinessPi/wiki Αναφορά προβλήματος Για αναφορά προβλήματος σχετικό με οποιοδήποτε τμήμα του έργου BusinessPi (Λειτουργικό σύστημα, Λογισμικά, Ιστοσελίδα, Wiki) παρακαλώ επισκεφθείτε την σελίδα: https://github.com/ellak-monades-aristeias/BusinessPi/issues κάντε κλίκ στο New Issue και συμπληρώστε το αίτημά σας όπως φαίνεται στην εικόνα παρακάτω απαντώντας κάποιες βασικές ερωτήσεις και δίνοντας αναλυτικές πληροφορίες για να μπορεί να αναπαραχθεί το πρόβλημα που αντιμετωπίζετε ώστε να γίνει προσπάθεια επίλυσής του. Επικοινωνία - Συζήτηση Για συζήτηση, η για να θέσετε ένα ερώτημα παρακαλώ επισκεφθείτε την σελίδα: https://github.com/ellak-monades-aristeias/BusinessPi/issues κάντε κλίκ στο New Issue και γράψτε το αίτημα η την ερώτησή σας.","tags":"pages","loc":"http://businesspi.github.io/pages/feedback.html","title":"Feedback"},{"text":"Μιας και ολοκληρώθηκε η βασική δομή της ιστοσελίδας του BusinessPi θεώρησα ότι θα ήταν λογικό ανεβάσω μια εικόνα του BananaPi στο οποίο αναπτύσσεται το έργο. Επίσης να αναφέρω ότι ήδη έχει ξεκινήσει η σύνταξη της τεκμηρίωσης του όλου εγχειρήματος στο Wiki page . Υπάρχουν όμως πολλά ακόμα που έχουν να γίνουν σχετικά με το έργο αλλά και την καταγραφή της όλης προσπάθειας και είναι ήδη προγραμματισμένα να ανέβουν στην ιστοσελίδα, το wiki αλλά και το αποθετήριο.","tags":"Photos","loc":"http://businesspi.github.io/epi-to-ergon.html","title":"Επί το έργον"},{"text":"Αυτή είναι η επίσημη σελίδα του έργου BusinessPi.","tags":"News","loc":"http://businesspi.github.io/hello-world.html","title":"Hello World"}]}